// Напиши функцію findLongestWord(string), яка приймає довільний рядок, що складається тільки зі слів, розділених пробілом (параметр string), і повертає найдовше слово в цьому рядку.

// Оголошена функція findLongestWord(string)
// Виклик функції findLongestWord("The quick brown fox jumped over the lazy dog") повертає jumped
// Виклик функції findLongestWord("Google do a roll") повертає Google
// Виклик функції findLongestWord("May the force be with you") повертає force
// Виклик функції findLongestWord() з випадковим рядком повертає правильне значення

function findLongestWord(string) {
    // Change code below this line
  
  let word = string.split (" ");
  let LongestWord = "";
  
    for (let i = 0; i < word.length; i+=1) {
      if (word[i].length > LongestWord.length){
        LongestWord = word[i]
      }
    }
  return LongestWord;
    // Change code above this line
  }

//   String.split()
// split() - розбиває рядок на масив рядків шляхом розділення рядка вказаним підрядком.

// Синтаксис:
// str.split([ separator [, limit]])
// Параметри:
// separator - не обов'язковий параметр. Вказує символи або регулярний вираз. Якщо параметр дорівнює пустому рядку ("") то рядок буду перетворено в масив символів. Якщо параметр не вказано повертає масив з одним рядковим елементом.

// limit - не обов'язковий параметр. Ціле число, вказує обмеження на кількість елементів масиву.

// Опис:
// split() метод об'єкту String який розбиває рядок на частини за вказаним роздільником і повертає новий масив з частин.

// Якщо роздільник separator знайдений, він видаляється з рядка, а підрядки повертаються в масиві. Якщо роздільник опущений, масив буде містити тільки один елемент, що складається з усього рядка. Якщо роздільник є символом нового рядка, рядок str буде перетворена в масив символів.

// Якщо роздільник є регулярним виразом, що містить підгрупи, то кожен раз при зіставленні з роздільником, результати (включаючи ті, що не визначені) захоплення підгрупи будуть поміщатися всередину вихідного масиву. Однак, не всі браузери підтримують цю можливість.

// Приклад:
// var s = "5 25 45 26 47 85";
// mas = s.split(' ');
// alert( mas );

// var s="Київ, Львів, Одеса, Харків";

// x=s.split(','); //x=array("Київ"," Львів"," Одеса"," Харків");

// s="text";
// x=s.split(''); //x=array("t","e","x","t");

// s="";
// x=s.split(); //array("");

