/*Ім'я товару змінили на "Repair droid" і збільшили його ціну на 1500 кредитів. Перевизнач значення змінних pricePerItem і productName після їх оголошення.

Змінна pricePerItem оголошена за допомогою let
При оголошенні змінної pricePerItem присвоєно значення — число 2000
Змінній pricePerItem присвоєно нове значення, більше за попереднє на 1500
Змінна productName оголошена за допомогою let
При оголошенні змінної productName присвоєно значення — рядок "Droid"
Змінній productName присвоєно нове значення — рядок "Repair droid"*/

let productName = 'Droid';
let pricePerItem = 2000;

// Change code below this line
pricePerItem = 3500;
console.log(pricePerItem);

productName = 'Repair droid';
console.log(productName);
/*let - оголошує змінну з блоковою областю видимості.
let дозволяє оголосити локальну змінну з обмеженою поточним блоком { } коду областю видимості.
 Відміну від var , яке оголошує змінну глобально або локально в усій функції незалежно від області блоку.
Старі браузери не підтримують let, так як це стандарт ES6.

var - оголошення змінної.

Для оголошення змінної використовують var. Після того як зміну оголошено її можна використовувати: присвоювати значення, змінювати, видаляти тощо. Детальніше: операції зі змінними

Зверніть увагу що називати змінні зарезервованими ключовими словами JavaScript(var, for, if, class і т.п.) не можна, так як це призведе до помилки синтаксису коду:
У JavaScript до оголошених змінних за допомогою var можна звертатися до їх оголошення, але тоді їх значення буде undefined.

console - об'єкт для роботи з консолю браузера.
*/
