/*Оголоси функцію sayHi, всередині якої додай console.log() з рядком "Hello, this is my first function!". Після оголошення виклич функцію sayHi.

Очікується оголошення функції
Функції присвоєно ім'я sayHi
В тілі функції sayHi є console.log("Hello, this is my first function!")
Після оголошення є виклик функції sayHi*/

function sayHi() {
    console.log("Hello, this is my first function!")};
  sayHi(); // 

  /*Функція - це підпрограма, незалежна частина коду, призначена для багаторазового виконання конкретної задачі з різними початковими значеннями.
  Оголошення функції починається з ключового слова function, за яким йде її ім'я — дієслово, що відповідає на питання «Що зробити?» і пара круглих дужок. Тіло функції береться у фігурні дужки {} і містить інструкції, які необхідно виконати під час її виклику. Потім, коли необхідно, функція викликається за допомогою імені та пари круглих дужок.
  
  Конструктор function створює новий об'єкт Function. В JavaScript кожна функція є об'єктом Function.

FunctionName - Ідентифікатор функції, який містить назву новоствореної функції по якому можна звертатися до функції. Якщо ідентифікатора не вказано тоді це буде анонімна функція.

argname1 ... argnameN - Список аргументів функції які передаються або іншими словами параметри функції. Кожне ім'я повинне мати унікальну назву. Список доступний у функції за допомогою arguments.

functionCode - блок коду JavaScript який буде виконуватися при виконанні функції.
  */