
// Доповни функцію sortByName(users) таким чином, щоб вона повертала масив користувачів, відсортований за їх ім'ям (властивість name) в алфавітному порядку.

// Оголошена змінна sortByName
// Змінній sortByName присвоєна стрілочна функція з параметром (users)
// Значення параметра users не змінюється
// Для перебирання параметра users використаний метод sort()
// Виклик функції із зазначеним масивом користувачів повертає новий масив користувачів, відсортований за ім'ям в алфавітному порядку
// Виклик функції з випадковими, але валідними аргументами, повертає правильне значення
// Change code below this line
const sortByName = users => {
    return users.slice().sort((a, b) => a.name.localeCompare(b.name));
    };
    // Change code above this line