/*Оголоси дві змінні, productName для назви товару, і pricePerItem для зберігання ціни за штуку. При оголошенні надай змінним наступні значення:

назва - рядок "Droid";
ціна за штуку - число 2000.
Оголошена змінна productName
Значення змінної productName - це рядок "Droid"
Оголошена змінна pricePerItem
Значення змінної pricePerItem - це число 2000*/

/*Оголоси дві змінні, productName для назви товару, і pricePerItem для зберігання ціни за штуку. При оголошенні надай змінним наступні значення:

назва - рядок "Droid";
ціна за штуку - число 2000.
Оголошена змінна productName
Значення змінної productName - це рядок "Droid"
Оголошена змінна pricePerItem
Значення змінної pricePerItem - це число 2000*/

const productName = 'Droid';
const pricePerItem = 2000;

/*const створює посилання на значення, яке змінити не можна. 
Константа це та ж сама змінна тільки її присвоєння не можна 
перезаписати після оголошення (це може призвести до виникнення
     помилки або браузер просто проігнорує зміну значення і 
     у константи значення не зміниться). Також константу не можна повторно оголошувати.

     productName - назва константи.
     Droid - значення константи, може містити будь який тип даних.*/