/*Оголоси наступні змінні, використовуючи ключове слово const або let, і присвой їм відповідні значення.

topSpeed - число 160.
distance - число 617.54.
login - рядок "mango935".
isOnline - буль true.
isAdmin - буль false.
Оголошена змінна topSpeed
Значення змінної topSpeed - це число 160
Оголошена змінна distance
Значення змінної distance - це число 617.54
Оголошена змінна login
Значення змінної login - це рядок "mango935"
Оголошена змінна isOnline
Значення змінної isOnline - це буль true
Оголошена змінна isAdmin
Значення змінної isAdmin - це буль false*/

const topSpeed = 160;
const distance = 617.54;


const login = "mango935";


const isOnline = true;
const isAdmin = false;

/*Number - цілі числа і числа з плаваючою комою (крапкою).
String - рядки, послідовність від нуля або більше символів. Рядок починається і закінчується одинарною ' або подвійними лапками ".
Boolean - логіBolean - логічний (булевий) тип даних. Примітивний тип даних в інформатиці , що може приймати два можливих значення, що іноді називаються істиною(true) і хибою(false) (так і ні).


var x=true;

if(x==true) alert('істина');
else alert('хиба');

При створені об'єкта значення value перетворюється у логічний тип даних. Якщо значення value
не вказано або дорівнює 0, false, Nan, undefined, null, порожній рядок "" тоді value дорівнює false інакше true.

Якщо уже використовуєте об'єкт Boolean то при використанні умовного оператора щодо об'єкту використовуйте умовне порівняння == або ще краще ===. Приклад правильного порівняння у умовному операторі if для об'єкта Boolean:

У явному JavaScript-програмуванню об'єкт Boolean не використовується, а використовують логічний тип даних.

Методи:
Boolean.toString() - повертає рядкове представлення об'єкту.
Boolean.valueOf() - повертає примітивне значення об'єкта.


Booolean.toString() - повертає рядкове представлення об'єкту Boolean.
bolOj.toString()
toString() метод об'єкта Boolean який повертає рядкове представлення об'єкту. Якщо логічне значення дорівнює true , повертається рядок "true". В іншому випадку повертається рядок "false".

toString() викликається автоматично коли необхідно представити Boolean як рядок.

Boolean.valueOf()
Boolean.valueOf() - Повертає примітивне значення об'єкту Boolean.

Синтаксис:
Boolean.valueOf()
Опис:
Повертає примітивне значення (true або false) зазначеного логічного значення.

Приклад:

var x=new Boolean(false);
alert( x.valueOf() ); // false

x=true;
alert( x.valueOf() ); //true




*/