
/*Доповни код, присвоївши змінній totalPrice вираз для підрахунку загальної суми замовлення. Змінна pricePerItem зберігає ціну однієї одиниці товару, а orderedQuantity - кількість одиниць товару в замовленні.

Оголошена змінна pricePerItem
Значення змінної pricePerItem - це число 3500
Оголошена змінна orderedQuantity
Значення змінної orderedQuantity - це число 4
Оголошена змінна totalPrice
Значення змінної totalPrice - це число 14000
Використаний оператор **/

const productName = "Droid";
const pricePerItem = 3500;

// Change code below this line
const message = `You picked ${productName}, price per item is ${pricePerItem} credits`;

/*Шаблонні рядки — це альтернатива конкатенації зі зручнішим синтаксисом. Шаблонний рядок береться у зворотні (скісні) лапки, замість подвійних або одинарних, і може містити місцезаповнювачі, які позначаються знаком долара і фігурними дужками - ${вираз}.
`` шаблоний рядок (шаблоний літерал) який дозволяє створювати рядок за вказаним шаблоном.

Можливі вказувати в шаблонні:
вираз. Дозволяє вставляти вирази: змінні, функції і т.п. у рядок: ${вираз}*/